<a href="https://colab.research.google.com/github/Nabaranjan/Pandas/blob/main/Important_Series_of_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#astype
#between
#clip
#drop_duplicates
#isnull
#dropna
#fillna
#isin
#apply
#copy

In [1]:
import numpy as np
import pandas as pd

In [6]:
subs = pd.read_csv('/content/subs.csv').squeeze()
print(subs)

0       48
1       57
2       40
3       43
4       44
      ...
360    231
361    226
362    155
363    144
364    172
Name: Subscribers gained, Length: 365, dtype: int64

In [10]:
vk = pd.read_csv('/content/kohli_ipl.csv',index_col='match_no').squeeze()
vk

match_no
1       1
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [11]:
movies = pd.read_csv('/content/bollywood.csv',index_col='movie').squeeze()
movies

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
                                              ...
Hum Tumhare Hain Sanam                    Shah Rukh Khan
Aankhen (2002 film)                     Amitabh Bachchan
Saathiya (film)                             Vivek Oberoi
Company (film)                                Ajay Devgn
Awara Paagal Deewana                        Akshay Kumar
Name: lead, Length: 1500, dtype: object

In [12]:
#astype
import sys
sys.getsizeof(vk)

3456

In [13]:
sys.getsizeof(vk.astype('int16'))

2166

In [16]:
#between

vk[vk.between(51,99)].size

43

In [17]:
# clip

subs.clip(100,200)

0      100
1      100
2      100
3      100
4      100
      ...
360    200
361    200
362    155
363    144
364    172
Name: Subscribers gained, Length: 365, dtype: int64

In [18]:
# drop_duplicates

temp = pd.Series([1,1,2,2,3,3,3,4,4])
temp

0    1
1    1
2    2
3    2
4    3
5    3
6    3
7    4
8    4
dtype: int64

In [19]:
temp.drop_duplicates()

0    1
2    2
4    3
7    4
dtype: int64

In [20]:
temp.drop_duplicates(keep='last')

1    1
3    2
6    3
8    4
dtype: int64

In [21]:
temp.drop_duplicates(keep='last')

1    1
3    2
6    3
8    4
dtype: int64

In [22]:
movies.drop_duplicates()

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
                                              ...
Sssshhh...                              Tanishaa Mukerji
Rules: Pyaar Ka Superhit Formula                  Tanuja
Right Here Right Now (film)                        Ankit
Talaash: The Hunt Begins...                Rakhee Gulzar
The Pink Mirror                          Edwin Fernandes
Name: lead, Length: 566, dtype: object

In [25]:
temp.duplicated().sum()

5

In [26]:
temp.duplicated().sum()

5

In [27]:
vk.duplicated().sum()

137

In [28]:
# isnull

temp.isnull().sum()

0

In [29]:
# dropna

temp.dropna()

0    1
1    1
2    2
3    2
4    3
5    3
6    3
7    4
8    4
dtype: int64

In [30]:
#fillna

temp.fillna(0)

0    1
1    1
2    2
3    2
4    3
5    3
6    3
7    4
8    4
dtype: int64

In [31]:
temp.fillna(temp.mean())

0    1
1    1
2    2
3    2
4    3
5    3
6    3
7    4
8    4
dtype: int64

In [32]:
#isin

vk == 50

match_no
1      False
2      False
3      False
4      False
5      False
       ...
211    False
212    False
213    False
214    False
215    False
Name: runs, Length: 215, dtype: bool

In [34]:
# isin

vk[(vk == 49) | (vk == 99)]

match_no
82    99
86    49
Name: runs, dtype: int64

In [35]:
vk[vk.isin([49,99])]

match_no
82    99
86    49
Name: runs, dtype: int64

In [36]:
# apply

movies

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
                                              ...
Hum Tumhare Hain Sanam                    Shah Rukh Khan
Aankhen (2002 film)                     Amitabh Bachchan
Saathiya (film)                             Vivek Oberoi
Company (film)                                Ajay Devgn
Awara Paagal Deewana                        Akshay Kumar
Name: lead, Length: 1500, dtype: object

In [38]:
movies.apply(lambda x:x.split()[0].upper())

movie
Uri: The Surgical Strike                  VICKY
Battalion 609                             VICKY
The Accidental Prime Minister (film)     ANUPAM
Why Cheat India                          EMRAAN
Evening Shadows                            MONA
                                         ...
Hum Tumhare Hain Sanam                     SHAH
Aankhen (2002 film)                     AMITABH
Saathiya (film)                           VIVEK
Company (film)                             AJAY
Awara Paagal Deewana                     AKSHAY
Name: lead, Length: 1500, dtype: object

In [39]:
subs

0       48
1       57
2       40
3       43
4       44
      ...
360    231
361    226
362    155
363    144
364    172
Name: Subscribers gained, Length: 365, dtype: int64

In [40]:


subs.apply(lambda x:'good day' if x > subs.mean() else 'bad day')

0       bad day
1       bad day
2       bad day
3       bad day
4       bad day
         ...
360    good day
361    good day
362    good day
363    good day
364    good day
Name: Subscribers gained, Length: 365, dtype: object

In [41]:
# copy

vk

match_no
1       1
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [44]:
new = vk.head()
new

match_no
1     1
2    23
3    13
4    12
5     1
Name: runs, dtype: int64

In [46]:
new[1] = 1

In [47]:
new = vk.head().copy()

In [48]:
new[1] = 100

In [49]:
new

match_no
1    100
2     23
3     13
4     12
5      1
Name: runs, dtype: int64